FutureDesigns/uEZ/uEZ/Source/Platform/Renesas/RDK_RX63N/RDK_RX63N.c
    // Ensure the RTC exists in the HAL level
    RX63N_RTC_Require();
    RTC_Generic_Create("RTC", "RTC");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Temp_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Temperature device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Temp_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
    Temp_AnalogDevices_ADT7420_Create("Temp0", "I2C0", 0x90 >> 1);
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_Accel_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the Accelerometer device driver.
 *---------------------------------------------------------------------------*/
void UEZPlatform_Accel_Require(void)
{
    DEVICE_CREATE_ONCE();

    UEZPlatform_I2C0_Require();
    ST_Accelerometer_ADXL345_Create("Accel0", "I2C0");
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZPlatform_WiredNetwork0_Require
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the networking for Wired connections.
 *---------------------------------------------------------------------------*/
void UEZPlatform_WiredNetwork0_Require(void)
{
    DEVICE_CREATE_ONCE();

	RX63N_UnlockProtectionBits();

    // Wired network needs an EMAC
    RX63N_100_EMAC_RMII_Require();

    // Create the network driver for talking to lwIP on a wired
    // network.
    Network_lwIP_Create("WiredNetwork0");
}

/*---------------------------------------------------------------------------*
 * Routine:  uEZPlatformInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Initialize the board with all the proper settings.
 *      Registers all peripherals specific to this board.
 *---------------------------------------------------------------------------*/
void uEZPlatformInit(void)
{
    // Do any initialiation necessary before the RTOS is started
}

void UEZPlatform_Standard_Require(void)
{
	
}

void UEZPlatform_Full_Require(void)
{
    // Setup console immediately
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
    
	UEZPlatform_S12AD_Require();
	UEZPlatform_SPI0_Require();
	UEZPlatform_Temp_Require();
	UEZPlatform_Accel_Require();
	UEZPlatform_Speaker_Require();
	UEZPlatform_DataFlash_Require();
	UEZPlatform_RTC_Require();
}

void UEZPlatform_Minimal_Require(void)
{
    // Setup console immediately
    UEZPlatform_Console_Require(UEZ_CONSOLE_WRITE_BUFFER_SIZE,
            UEZ_CONSOLE_READ_BUFFER_SIZE);
}

TUInt16 UEZPlatform_LCDGetHeight(void)
{
	// Needed by the library but not used
    return 0;
}

TUInt16 UEZPlatform_LCDGetWidth(void)
{
	// Needed by the library but not used
    return 0;
}

TUInt32 UEZPlatform_SerialGetDefaultBaud(void)
{
    return 115200;
}

TUInt32 UEZPlatform_ProcessorGetFrequency(void)
{
    return PROCESSOR_OSCILLATOR_FREQUENCY;
}

TUInt32 UEZPlatform_GetEMACPHYAddress(void)
{
    return 1; // National DP83640
}

void UEZPlatformWriteChar(char aChar)
{
    putchar(aChar);
}
/*
extern void WriteByteInFrameBufferWithAlpha(
        TUInt32 aAddr,
        COLOR_T aPixel,
        T_swimAlpha aAlpha)
{
    // Needed by the library but not used
}
*/
void ForceCodeNotToBeRemovedDuringOptimizedLink(void)
{
	extern void vSoftwareInterruptEntry(void);
	
	// This code is a trick to the HEW compiler.  It ensures
	// the the list of functions are definitely compiled into
	// the code instead of being optimized out.  Without this
	// function, the uEZ code will not work with HEW Renesas RX
	// compiler! -- 3/19/2012
	vSoftwareInterruptEntry();
}

/*---------------------------------------------------------------------------*
 * Routine:  main
 *---------------------------------------------------------------------------*
 * Description:
 *      The main() routine in UEZ is only a stub that is used to start
 *      the whole UEZ system.  UEZBSP_Startup() is immediately called.
 * Outputs:
 *      int -- not used, 0
 *---------------------------------------------------------------------------*/
int main(void)
{
	TUInt32 i;
	
	PORTC.PDR.BIT.B3 = 1; // RESET_IO
	PORTC.PODR.BIT.B3 = 1; // RESET_IO
    for (i=0;i<1000000;i++){}
    PORTC.PODR.BIT.B3 = 0; // RESET_IO
    for (i=0;i<1000000;i++){}
	
	UEZBSP_Startup();
    while (1) {
		// never should get here
		ForceCodeNotToBeRemovedDuringOptimizedLink();
    } 
}

/*-------------------------------------------------------------------------*
 * End of File:  uEZPlatform.c
 *-------------------------------------------------------------------------*/
